Revit 2027 API
IExternalDataManagerServer.GetContentTools Method
 Obtains the content tool items of the selected data
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
IList<ExternalDataManagerTool> GetContentTools(
	Document document
)
Function GetContentTools (
	document As Document
) As IList(Of ExternalDataManagerTool)
IList<ExternalDataManagerTool^>^ GetContentTools(
	Document^ document
)
abstract GetContentTools :
        document : Document -> IList<ExternalDataManagerTool>
Parameters
document Document
 The document.
Return Value
IList<ExternalDataManagerTool>
 The content tool items of the selected data.
Remarks
 The returned tool structure is used to build the context-sensitive content tools shown above the data grid and the right-click menu. The server can tailor the list based on current selection.
See Also
Reference
IExternalDataManagerServer Interface
Autodesk.Revit.UI Namespace